W8D1/RedditClone/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "hello_world"], ["url", ""], ["content", ""], ["sub_id", 1], ["author_id", 1], ["created_at", "2020-09-14 23:59:39.250565"], ["updated_at", "2020-09-14 23:59:39.250565"]]
---
    def create
        @post = Post.new(post_params)
        @post.author_id = current_user.id
        if @post.save