W8D1/RedditClone/app/controllers/subs_controller.rb

    def update
        @sub = Sub.find(params[:id])
        if is_moderator?(@sub)
            if @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "Rails Servers"], ["description", "All about Rails server setup."], ["updated_at", "2020-09-14 23:18:19.531129"], ["id", 2]]