W6D4/practice_project day 2/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" LEFT OUTER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE "artworks"."artist_id" = $1  [["artist_id", 10]]
---
    def index
        artworks = Artwork.where(artist_id: params[:user_id]).left_outer_joins(:artwork_shares)