W6D4/practice_project day 2/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "name", "breed", "age") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2020-09-02 22:27:37.914533"], ["updated_at", "2020-09-02 22:27:37.914533"], ["name", "Porkchop"], ["breed", "pig"], ["age", 3]]
---
    def create
        user = User.new(user_params)

        if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def update
        user = User.find(params[:id])